<a href="https://colab.research.google.com/github/TatyanaSandanova/pis1/blob/main/%D0%9F%D0%A03%2C_%D0%A1%D0%B0%D0%BD%D0%B4%D0%B0%D0%BD%D0%BE%D0%B2%D0%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import packages

In [37]:
import pandas as pd
import numpy as np
from IPython.display import display

In [38]:
data = pd.read_csv ("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header= None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [39]:
names = ["Id","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe","Class"]
data.columns = names
data = data.drop(columns=["Id"])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [40]:
data['Class'].replace({1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float", 5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [30]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       195 non-null    float64
 1   1       201 non-null    float64
 2   2       203 non-null    float64
 3   3       201 non-null    float64
 4   4       203 non-null    float64
 5   5       195 non-null    float64
 6   6       203 non-null    float64
 7   7       197 non-null    float64
 8   8       197 non-null    float64
 9   9       203 non-null    float64
 10  10      197 non-null    float64
dtypes: float64(11)
memory usage: 18.5 KB

Data Vizualization

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       195 non-null    float64
 1   1       201 non-null    float64
 2   2       203 non-null    float64
 3   3       201 non-null    float64
 4   4       203 non-null    float64
 5   5       195 non-null    float64
 6   6       203 non-null    float64
 7   7       197 non-null    float64
 8   8       197 non-null    float64
 9   9       203 non-null    float64
 10  10      197 non-null    float64
dtypes: float64(11)
memory usage: 18.5 KB

In [32]:
data.describe()

               0           1           2   ...          8           9           10
count  195.000000  201.000000  203.000000  ...  197.000000  203.000000  197.000000
mean   106.758974    1.518368   13.412167  ...    0.175787    0.056601    2.746193
std     61.492002    0.003061    0.831729  ...    0.494316    0.097710    2.093856
min      1.000000    1.511150   10.730000  ...    0.000000    0.000000    1.000000
25%     54.500000    1.516550   12.915000  ...    0.000000    0.000000    1.000000
50%    105.000000    1.517690   13.310000  ...    0.000000    0.000000    2.000000
75%    160.500000    1.519160   13.875000  ...    0.000000    0.095000    3.000000
max    214.000000    1.533930   17.380000  ...    3.150000    0.510000    7.000000

[8 rows x 11 columns]

In [46]:
display(data['Class'].value_counts())
display(print("-----------------------------"))
display(data['Class'].describe())

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

-----------------------------

None

count                    214
unique                     6
top       building_non_float
freq                      76
Name: Class, dtype: object